tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendFlowCalibrationSessionPanel(const AppSnapshot& snapshot, bool taskActive) {
    const bool sessionActive = snapshot.calibrationStatus != CalibrationSessionStatus::Idle &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Applied &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Discarded &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Failed;
    const bool canStartSession = calibrationSessionInactive(snapshot.calibrationStatus) && !taskActive;
    const bool canDiscardSession = sessionActive && snapshot.calibrationStatus != CalibrationSessionStatus::Running && !taskActive;
    const bool canEnterActual = snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual;
    const bool canApply = snapshot.calibrationStatus == CalibrationSessionStatus::Generated && !taskActive;
    const bool autoRefreshSession =
        snapshot.calibrationStatus == CalibrationSessionStatus::WaitingLocalRun ||
        snapshot.calibrationStatus == CalibrationSessionStatus::Running;

    sendFmt("<section id='calibration-session' class='panel calibration-session-panel' data-calibration-status='%s' data-calibration-valid-samples='%u'>"
            "<div class='panel-head'><h3>校准流程</h3><div class='calibration-session-badges'>",
            calibrationSessionStatusCode(snapshot.calibrationStatus),
            static_cast<unsigned>(snapshot.calibrationValidSampleCount));
    sendFmt("<span class='status-pill %s'%s>%s</span>",
            sessionActive ? "status-warn" : "status-muted",
            autoRefreshSession ? " data-calibration-refresh" : "",
            calibrationSessionStatusText(snapshot.calibrationStatus));
    Esp32BaseWeb::sendChunk("</div></div><p class='muted'>至少 2 条有效样本后会自动生成参数；3 条以上更稳。到设备旁按 OK 开始校准出水，按 CANCEL 停止；网页只录入量杯读数并处理样本。</p>");
    if (snapshot.calibrationStatus == CalibrationSessionStatus::WaitingLocalRun) {
        Esp32BaseWeb::sendChunk("<p class='ok'>设备正在等待本地 OK 开始校准出水。页面会自动刷新状态。</p>");
    } else if (snapshot.calibrationStatus == CalibrationSessionStatus::Running) {
        Esp32BaseWeb::sendChunk("<p class='warn'>校准出水中。请在设备本地按 CANCEL 停止，停止后网页会进入实测容量录入。</p>");
    } else if (snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual) {
        Esp32BaseWeb::sendChunk("<p class='ok'>本次出水已停止，请按量杯读数填写实测容量。</p>");
    } else if (snapshot.calibrationStatus == CalibrationSessionStatus::Generated) {
        Esp32BaseWeb::sendChunk("<p class='ok'>已自动计算出参数建议；可以继续按 OK 补充样本，或确认使用这组参数。</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions calibration-primary-actions'>");
    if (!sessionActive) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='start_session'>");
        sendFmt("<input class='primary' type='submit' value='开始校准流程'%s></form>",
                canStartSession ? "" : " disabled");
    } else {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认退出并丢弃本次校准会话？')&&once(this)\">"
                                "<input type='hidden' name='action' value='discard_session'>");
        sendFmt("<input class='secondary' type='submit' value='退出校准流程'%s></form>",
                canDiscardSession ? "" : " disabled");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (canEnterActual) {
        Esp32BaseWeb::sendChunk("<form class='sample-calibration-form' method='post' action='/faucet/calibration/flow' onsubmit='return faucetSubmitFlowCalibrationAction(this)'>"
                                "<input type='hidden' name='action' value='save_actual'>"
                                "<label class='compact-field'><span>本次实测容量</span><span class='estimator-input-row'>"
                                "<input name='actualMl' type='number' min='");
        sendFmt("%lu", static_cast<unsigned long>(kCalibrationMinActualMl));
        Esp32BaseWeb::sendChunk("' max='");
        sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
        Esp32BaseWeb::sendChunk("' step='1' required><span class='unit-label'>ml</span></span></label>"
                                "<div class='form-actions'><input class='primary' type='submit' value='保存有效样本'></form>"
                                "<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认放弃本次出水样本？')&&faucetSubmitFlowCalibrationAction(this)\">"
                                "<input type='hidden' name='action' value='skip_attempt'>"
                                "<input class='danger' type='submit' value='放弃本次样本'></form></div>");
    }
    if (snapshot.calibrationStatus == CalibrationSessionStatus::Generated) {
        sendGeneratedMeteringCandidatePanel(snapshot.calibrationCandidate);
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions calibration-secondary-actions'>"
                            "<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认使用这组计量参数？')&&once(this)\">"
                            "<input type='hidden' name='action' value='apply_session'>");
    sendFmt("<input class='primary' type='submit' value='使用这组参数'%s></form></div></section>",
            canApply ? "" : " disabled");
}

void formatCentiTemperature(std::int32_t centi, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    const std::int32_t absCenti = centi < 0 ? -centi : centi;
    std::snprintf(out,
                  len,
                  "%s%ld.%02ld C",
                  centi < 0 ? "-" : "",
                  static_cast<long>(absCenti / 100),
                  static_cast<long>(absCenti % 100));
}

void formatSensorTemperature(const SensorValue& value, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "-");
        return;
    }
    formatCentiTemperature(value.value, out, len);
}

void formatSensorTemperatureNumber(const SensorValue& value, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "--");
        return;
    }
    const std::int32_t centi = value.value;
    const std::int32_t absCenti = centi < 0 ? -centi : centi;
    std::snprintf(out,
                  len,
                  "%s%ld.%02ld",
                  centi < 0 ? "-" : "",
                  static_cast<long>(absCenti / 100),
                  static_cast<long>(absCenti % 100));
}

void formatWaterRecordTemperature(const WaterRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (record.sensorSampleCount == 0 || (record.sensorFlags & kWaterSensorFlagTempInvalid) != 0) {
        std::snprintf(out, len, "--");
        return;
    }
    formatCentiTemperature(record.temperatureAvgCentiC, out, len);
}

