tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void formatWaterRecordTds(const WaterRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (record.sensorSampleCount == 0 || (record.sensorFlags & kWaterSensorFlagTdsInvalid) != 0) {
        std::snprintf(out, len, "--");
        return;
    }
    std::snprintf(out, len, "%u ppm", static_cast<unsigned>(record.tdsAvgPpm));
}

void formatSensorIntegerNumber(const SensorValue& value, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "--");
        return;
    }
    std::snprintf(out, len, "%ld", static_cast<long>(value.value));
}

void formatSensorIntegerValue(const SensorValue& value, const char* unit, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out, len, "%ld %s", static_cast<long>(value.value), unit ? unit : "");
}

bool parseI16(const char* text, std::int16_t& value) {
    if (!text || !*text) {
        return false;
    }
    char* end = nullptr;
    const long parsed = std::strtol(text, &end, 10);
    if (!end || *end != '\0' || parsed < INT16_MIN || parsed > INT16_MAX) {
        return false;
    }
    value = static_cast<std::int16_t>(parsed);
    return true;
}

const char* tdsCalibrationModeText(TdsCalibrationMode mode);

const char* recordTdsCalibrationText(const WaterRecord& record) {
    if (record.sensorSampleCount == 0) {
        return "--";
    }
    if (record.tdsCalibratedAtRun != 0 && (record.sensorFlags & kWaterSensorFlagTdsUncalibrated) == 0) {
        return tdsCalibrationModeText(static_cast<TdsCalibrationMode>(record.tdsCalibrationModeAtRun));
    }
    return "未校准";
}

void sendWaterRecordSensorRows(const WaterRecord& record) {
    char temperatureAvg[24]{};
    char temperatureMin[24]{};
    char temperatureMax[24]{};
    char tdsAvg[24]{};
    formatWaterRecordTemperature(record, temperatureAvg, sizeof(temperatureAvg));
    if ((record.sensorFlags & kWaterSensorFlagTempInvalid) != 0 || record.sensorSampleCount == 0) {
        std::snprintf(temperatureMin, sizeof(temperatureMin), "--");
        std::snprintf(temperatureMax, sizeof(temperatureMax), "--");
    } else {
        formatCentiTemperature(record.temperatureMinCentiC, temperatureMin, sizeof(temperatureMin));
        formatCentiTemperature(record.temperatureMaxCentiC, temperatureMax, sizeof(temperatureMax));
    }
    formatWaterRecordTds(record, tdsAvg, sizeof(tdsAvg));

    Esp32BaseWeb::sendChunk("<section class='panel record-detail-card'><h3>水质传感器</h3><table class='kv'>");
    if (record.sensorSampleCount == 0) {
        Esp32BaseWeb::sendChunk("<tr><th>水温</th><td>--</td></tr>"
                                "<tr><th>TDS</th><td>--</td></tr>"
                                "<tr><th>样本数</th><td>0</td></tr>");
    } else {
        sendFmt("<tr><th>水温平均</th><td>%s</td></tr>"
                "<tr><th>水温范围</th><td>%s - %s</td></tr>"
                "<tr><th>TDS 平均</th><td>%s</td></tr>"
                "<tr><th>TDS 范围</th><td>",
                temperatureAvg,
                temperatureMin,
                temperatureMax,
                tdsAvg);
        if ((record.sensorFlags & kWaterSensorFlagTdsInvalid) != 0) {
            Esp32BaseWeb::sendChunk("--");
        } else {
            sendFmt("%u ppm - %u ppm",
                    static_cast<unsigned>(record.tdsMinPpm),
                    static_cast<unsigned>(record.tdsMaxPpm));
        }
        sendFmt("</td></tr>"
                "<tr><th>TDS 电压平均</th><td>%u mV</td></tr>"
                "<tr><th>样本数</th><td>%u</td></tr>"
                "<tr><th>TDS 校准</th><td>%s</td></tr>"
                "<tr><th>TDS 校准版本</th><td>%u</td></tr>"
                "<tr><th>温度补偿</th><td>%s</td></tr>"
                "<tr><th>25C 回退</th><td>%s</td></tr>"
                "<tr><th>传感器标志</th><td>0x%04x</td></tr>",
                static_cast<unsigned>(record.tdsVoltageAvgMv),
                static_cast<unsigned>(record.sensorSampleCount),
                recordTdsCalibrationText(record),
                static_cast<unsigned>(record.tdsCalibrationRevisionAtRun),
                record.tdsTemperatureCompensatedAtRun ? "开启" : "关闭",
                record.tdsTempFallback25CAtRun ? "是" : "否",
                static_cast<unsigned>(record.sensorFlags));
    }
    Esp32BaseWeb::sendChunk("</table></section>");
}

const char* tdsCalibrationModeText(TdsCalibrationMode mode) {
    switch (mode) {
        case TdsCalibrationMode::None:
            return "未校准";
        case TdsCalibrationMode::SinglePoint:
            return "单点";
        case TdsCalibrationMode::TwoPoint:
            return "两点";
        case TdsCalibrationMode::MultiPoint:
            return "多点";
    }
    return "未知";
}

void sendCalibrationCenterFlowCard(const AppSnapshot& snapshot) {
    MeteringSchemeRecord active{};
    const bool activeReady = activeMeteringSchemeForWeb(active);
    const MeteringParameters params = activeReady ? active.params : snapshot.meteringParams;
    const bool sessionActive = !calibrationSessionInactive(snapshot.calibrationStatus);
    Esp32BaseWeb::sendChunk("<section class='panel calibration-center-card'><div class='panel-head'><h3>当前计量参数</h3>");
    if (sessionActive) {
        sendFmt("<span class='status-pill status-warn'>%s</span></div>",
                calibrationSessionStatusText(snapshot.calibrationStatus));
    } else {
        sendFmt("<span class='status-pill status-ok'>%s</span></div>",
                activeReady && active.name[0] ? active.name : "默认参数");
    }
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>启动脉冲</span><strong>%lu P</strong></div>",
            static_cast<unsigned long>(params.startupPulseCount));
    sendFmt("<div><span>启动水量</span><strong>%lu ml</strong></div>",
            static_cast<unsigned long>(params.startupVolumeMl));
    sendFmt("<div><span>启动时长</span><strong>%lu ms</strong></div>",
            static_cast<unsigned long>(params.startupDurationMs));
    sendFmt("<div><span>稳态 P/L</span><strong>%lu</strong></div>",
            static_cast<unsigned long>(params.stablePulsePerLiter));
    sendFmt("<div><span>稳态流速</span><strong>%lu ml/min</strong></div>",
            static_cast<unsigned long>(params.stableFlowMlPerMin));
    if (sessionActive) {
        sendFmt("<div><span>本次校准</span><strong>%u 样本</strong></div>",
                static_cast<unsigned>(snapshot.calibrationValidSampleCount));
    }
    Esp32BaseWeb::sendChunk("</div><div class='form-actions'>"
                            "<a class='btn-link primary' href='/faucet/calibration/flow'>");
    Esp32BaseWeb::sendChunk(sessionActive ? "继续流量计校准" : "进入流量计校准");
    Esp32BaseWeb::sendChunk("</a></div></section>");
}

void sendCalibrationCenterTemperatureCard(const AppSnapshot& snapshot, const SystemConfig& config) {
    char temperatureText[24]{};
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, temperatureText, sizeof(temperatureText));
    const bool enabled = config.temperatureEnabled && config.temperatureKind == TemperatureKind::Ntc50kB3950;
    Esp32BaseWeb::sendChunk("<section class='panel calibration-center-card'><div class='panel-head'><h3>温度校准</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            enabled ? (config.temperatureCalibrated ? "status-ok" : "status-warn") : "status-muted",
            enabled ? (config.temperatureCalibrated ? "已校准" : "未校准") : "未启用");
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>当前水温</span><strong>%s</strong></div>", enabled ? temperatureText : "未启用");
    sendFmt("<div><span>当前偏移</span><strong>%ld.%02ld C</strong></div>",
            static_cast<long>(config.temperatureOffsetCentiC / 100),
            static_cast<long>(std::abs(static_cast<int>(config.temperatureOffsetCentiC % 100))));
    Esp32BaseWeb::sendChunk("</div><p><a class='btn-link primary' href='/faucet/calibration?view=temperature'>进入温度校准</a></p></section>");
}

void sendCalibrationCenterTdsCard(const AppSnapshot& snapshot, const SystemConfig& config) {
    char tdsText[24]{};
    char voltageText[24]{};
    char tempText[24]{};
    formatSensorIntegerValue(snapshot.sensors.tdsPpm, "ppm", tdsText, sizeof(tdsText));
    formatSensorIntegerValue(snapshot.sensors.tdsVoltageMv, "mV", voltageText, sizeof(voltageText));
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, tempText, sizeof(tempText));
    const bool enabled = config.tdsEnabled && config.tdsKind == TdsKind::AnalogTdsAo;
    Esp32BaseWeb::sendChunk("<section class='panel calibration-center-card'><div class='panel-head'><h3>水质校准</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            enabled ? (config.tdsCalibrated ? "status-ok" : "status-warn") : "status-muted",
            enabled ? (config.tdsCalibrated ? tdsCalibrationModeText(config.tdsCalibrationMode) : "未校准") : "未启用");
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>当前 TDS</span><strong>%s</strong></div>", enabled ? tdsText : "未启用");
    sendFmt("<div><span>采样电压</span><strong>%s</strong></div>", enabled ? voltageText : "-");
    sendFmt("<div><span>水温补偿</span><strong>%s</strong></div>",
            config.tdsTemperatureCompensationEnabled ? tempText : "关闭");
    sendFmt("<div><span>scale</span><strong>%.3f</strong></div>", static_cast<double>(config.tdsScale));
    sendFmt("<div><span>offset</span><strong>%d ppm</strong></div>", static_cast<int>(config.tdsOffsetPpm));
    Esp32BaseWeb::sendChunk("</div><p><a class='btn-link primary' href='/faucet/calibration?view=tds'>进入水质校准</a></p></section>");
}

void sendTdsCalibrationPointsTable(const TdsCalibrationSessionSnapshot& session) {
    Esp32BaseWeb::sendChunk("<h4>已保存校准点</h4><table><tr><th>#</th><th>参考 ppm</th><th>原始 ppm</th><th>采样电压</th><th>操作</th></tr>");
    if (session.pointCount == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='5'>暂无校准点</td></tr>");
    }
    for (std::uint8_t i = 0; i < session.pointCount && i < kTdsCalibrationMaxPoints; ++i) {
        const TdsCalibrationPointSnapshot& point = session.points[i];
        sendFmt("<tr><td>%u</td><td>%u</td><td>%u</td><td>%u mV</td><td>"
                "<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                "<input type='hidden' name='action' value='tds_remove_point'>"
                "<input type='hidden' name='index' value='%u'>"
                "<input class='secondary' type='submit' value='删除'></form></td></tr>",
                static_cast<unsigned>(i + 1U),
                static_cast<unsigned>(point.referencePpm),
                static_cast<unsigned>(point.rawPpm),
                static_cast<unsigned>(point.voltageMv),
                static_cast<unsigned>(i));
    }
    Esp32BaseWeb::sendChunk("</table>");
}

