tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void formatWaterRecordTime(const WaterRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (waterRecordHasRealTime(record)) {
        formatRecordTime(record.startTime, out, len);
        return;
    }
    if (waterRecordHasBootRelativeTime(record)) {
        std::snprintf(out, len, "未知时间 / 本次开机+%lu s", static_cast<unsigned long>(record.startTime));
        return;
    }
    std::snprintf(out, len, "历史未知时间");
}

void formatWaterRecordListTime(const WaterRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (waterRecordHasRealTime(record)) {
        std::uint16_t year = 0;
        std::uint8_t month = 0;
        std::uint8_t monthDay = 0;
        dateFromDayIndex(record.startTime / 86400UL, year, month, monthDay);
        const std::uint32_t daySecond = record.startTime % 86400UL;
        std::snprintf(out,
                      len,
                      "%02u-%02u %02lu:%02lu",
                      static_cast<unsigned>(month),
                      static_cast<unsigned>(monthDay),
                      static_cast<unsigned long>(daySecond / 3600UL),
                      static_cast<unsigned long>((daySecond / 60UL) % 60UL));
        return;
    }
    if (waterRecordHasBootRelativeTime(record)) {
        std::snprintf(out, len, "开机+%lu s", static_cast<unsigned long>(record.startTime));
        return;
    }
    std::snprintf(out, len, "未知");
}

void sendNoticeFromQuery() {
    char text[32]{};
    if (getParam("saved", text, sizeof(text))) {
        const bool actualOnly = std::strcmp(text, "actual") == 0;
        const bool generated = std::strcmp(text, "generated") == 0;
        const bool restored = std::strcmp(text, "restored") == 0;
        const bool sampleRemoved = std::strcmp(text, "sample_removed") == 0;
        const bool tdsStarted = std::strcmp(text, "tds_started") == 0;
        const bool tdsPointStarted = std::strcmp(text, "tds_point_started") == 0;
        const bool tdsPointSaved = std::strcmp(text, "tds_point_saved") == 0;
        const bool tdsSaved = std::strcmp(text, "tds_saved") == 0;
        const bool tdsDiscarded = std::strcmp(text, "tds_discarded") == 0;
        Esp32BaseWeb::sendChunk("<p class='ok'>");
        Esp32BaseWeb::sendChunk(actualOnly   ? "校准已保存。"
                                : generated  ? "参数已生成。"
                                : restored           ? "已恢复上一套参数。"
                                : sampleRemoved      ? "样本已移除。"
                                : tdsStarted         ? "水质校准已开始。"
                                : tdsPointStarted    ? "校准点采集已开始，页面会自动刷新到可保存状态。"
                                : tdsPointSaved      ? "校准点已保存。"
                                : tdsSaved           ? "水质校准参数已应用。"
                                : tdsDiscarded       ? "本次水质校准已丢弃。"
                                                     : "已保存。");
        Esp32BaseWeb::sendChunk("</p>");
        return;
    }
    if (getParam("reset", text, sizeof(text))) {
        Esp32BaseWeb::sendChunk("<p class='ok'>已重置。</p>");
        return;
    }
    if (!getParam("error", text, sizeof(text))) {
        return;
    }
    const char* message = "操作失败，请检查输入后重试。";
    if (std::strcmp(text, "busy") == 0) {
        message = "设备不在待机状态，请回到待机后再保存配置。";
    } else if (std::strcmp(text, "invalid_index") == 0) {
        message = "编号无效，请返回列表重新选择。";
    } else if (std::strcmp(text, "invalid_value") == 0) {
        message = "数值超出允许范围，请按页面提示填写。";
    } else if (std::strcmp(text, "invalid_action") == 0) {
        message = "操作无效，请刷新页面后重试。";
    } else if (std::strcmp(text, "invalid_state") == 0) {
        message = "现在不允许执行这个操作，请刷新页面后按当前步骤继续。";
    } else if (std::strcmp(text, "calibration_storage_unavailable") == 0) {
        message = "校准存储未就绪，请检查设备存储空间或重启后再试。";
    } else if (std::strcmp(text, "invalid_date") == 0) {
        message = "日期格式无效，请重新选择日期。";
    } else if (std::strcmp(text, "save_failed") == 0) {
        message = "保存失败，请稍后重试。";
    } else if (std::strcmp(text, "metering_storage_unavailable") == 0) {
        message = "计量方案存储不可用；请检查存储状态，系统不会自动删除原文件。";
    } else if (std::strcmp(text, "no_calibration_record") == 0) {
        message = "最新记录没有可用的有效脉冲，不能用于校准。";
    } else if (std::strcmp(text, "calibration_unchanged") == 0) {
        message = "实际出水量未变化，未保存校准。";
    } else if (std::strcmp(text, "calibration_drift") == 0) {
        message = "新系数和旧系数偏差过大，请重新接水测量。";
    } else if (std::strcmp(text, "sample_not_enough") == 0) {
        message = "可用样本不足，至少需要两条有效样本。";
    } else if (std::strcmp(text, "no_generated_result") == 0) {
        message = "还没有可使用的参数，请先完成至少两条有效校准样本。";
    } else if (std::strcmp(text, "no_previous") == 0) {
        message = "没有可恢复的上一套参数。";
    }
    Esp32BaseWeb::sendChunk("<p class='err'>");
    Esp32BaseWeb::sendChunk(message);
    Esp32BaseWeb::sendChunk("</p>");
}

void sendAppCss() {
    Esp32BaseWeb::sendChunk(":root{--bg:#f7f9f8;--surface:#fff;--line:#dfe8e5;--text:#243039;--muted:#68767d;--accent:#2f7f75;--accent-soft:#edf6f3}"
                            "body{max-width:1040px;margin:0 auto;padding:14px 16px;background:var(--bg);color:var(--text);font:14px/1.45 -apple-system,BlinkMacSystemFont,'Segoe UI',Arial,'PingFang SC','Microsoft YaHei',sans-serif}"
                            "h1,h2,h3{letter-spacing:0}h2{font-size:20px;margin:18px 0 10px}h3{font-size:15px;margin:0 0 8px}p{margin:0 0 8px}.muted,.hint{color:var(--muted)}.hint{display:block;font-size:12px;margin-top:3px}");
    Esp32BaseWeb::sendChunk("nav,.footerbar,.panel,.metric-card,.filter-card,table{background:var(--surface);border:1px solid var(--line);border-radius:6px}"
                            "nav{display:flex;gap:6px;align-items:center;margin:0 0 16px;padding:8px;overflow-x:auto}nav a,.btn-link,.page-link,.page-current,.row-actions a{display:inline-flex;align-items:center;justify-content:center;min-height:30px;padding:0 10px;border:1px solid var(--line);border-radius:6px;background:#f8faf9;color:#305f66;text-decoration:none;box-sizing:border-box}nav a.active,.page-current{background:var(--accent-soft);color:#17635b;border-color:#cfe4dc}.brand{font-weight:750}.footerbar{margin-top:18px;padding:10px 12px}");
    Esp32BaseWeb::sendChunk(".panel{padding:12px;margin:12px 0;overflow-x:auto}.panel-head{display:flex;align-items:center;justify-content:space-between;gap:8px;margin-bottom:8px}.grid,.metric-grid,.filter-cards,.usage-grid,.machine-task-grid,.active-metering-metrics,.calibration-kpi-grid,.tds-calibration-summary,.temperature-calibration-summary{display:grid;grid-template-columns:repeat(auto-fit,minmax(160px,1fr));gap:10px}.metric-card,.filter-card,.metering-metric,.calibration-kpi{padding:10px 12px}.metric-card span,.metering-metric span,.calibration-kpi span{display:block;color:var(--muted);font-size:12px}.metric-card strong,.metering-metric strong,.calibration-kpi strong{display:block;margin-top:4px;font-size:17px}");
    Esp32BaseWeb::sendChunk("table{width:100%;border-collapse:collapse;margin:0 0 12px;font-size:13px}td,th{padding:7px 8px;border-bottom:1px solid #edf1f0;text-align:left;vertical-align:middle}th{background:#f8faf9;color:var(--muted);font-weight:700}.kv th{width:28%}.status-pill{display:inline-flex;align-items:center;min-height:22px;padding:0 8px;border-radius:999px;background:#eef2f2;color:#55616a;font-size:12px;font-weight:650;white-space:nowrap}.status-ok{background:#e8f4ee;color:#21634c}.status-warn{background:#fff7e6;color:#7a520e}.status-error,.err{color:#9b3328}.status-muted{background:#eef2f2;color:#66737c}.warn{display:block;background:#fff8e6;border:1px solid #ead28b;border-radius:6px;padding:8px;color:#6b4a12}");
    Esp32BaseWeb::sendChunk(".form-grid,.manual-param-grid{display:grid;grid-template-columns:repeat(12,1fr);gap:10px 12px}.span-2{grid-column:span 2}.span-3{grid-column:span 3}.span-4{grid-column:span 4}.span-5{grid-column:span 5}.span-6{grid-column:span 6}.span-8{grid-column:span 8}.span-12,.scheme-span-12{grid-column:1/-1}.field span,.compact-field span,.check-title{display:block;color:var(--muted);font-size:12px;font-weight:650;margin-bottom:4px}input,select{max-width:100%;box-sizing:border-box}.form-actions,.row-actions,.pager,.pager-links{display:flex;align-items:center;gap:6px;flex-wrap:wrap}.form-actions{margin-top:10px}.page-disabled{color:#9aa3aa;pointer-events:none}.disabled-row{color:#8a949b;background:#f7f8f8}");
    Esp32BaseWeb::sendChunk(".machine-main,.today-layout,.record-detail-grid,.calibration-session-layout{display:grid;grid-template-columns:repeat(auto-fit,minmax(260px,1fr));gap:12px}.machine-hero strong,.today-total-main{font-size:26px}.progress,.filter-track{height:8px;background:#e2e9e7;border-radius:999px;overflow:hidden}.progress span,.filter-progress-fill{display:block;height:100%;background:var(--accent)}.today-records,.calibration-param-panel{overflow-x:auto}.calibration-slot-table,.today-record-table{min-width:760px}.sample-calibration-edit-row{display:none}.sample-calibration-edit-row.is-open{display:table-row}.unit-label{display:inline-flex;align-items:center;padding:0 8px;color:var(--muted)}@media(max-width:720px){body{padding:10px}.form-grid,.manual-param-grid{grid-template-columns:1fr}.span-2,.span-3,.span-4,.span-5,.span-6,.span-8,.span-12,.scheme-span-4,.scheme-span-12{grid-column:1/-1}} ");
}


void sendAppStylesheetLink() {
    Esp32BaseWeb::sendChunk("<link rel='stylesheet' href='/faucet/app.css?v=" FAUCET_WEB_CSS_VERSION "'>");
}

bool sendPageStart(const char* title) {
    if (!Esp32BaseWeb::checkAuth()) {
        return false;
    }
    Esp32BaseWeb::sendHeader(title);
    return true;
}

void sendPageEnd() {
    Esp32BaseWeb::sendFooter();
}

const char* stateText(WaterState state) {
    switch (state) {
        case WaterState::Idle:
            return "待机";
        case WaterState::Confirm:
            return "确认";
        case WaterState::Running:
            return "出水中";
        case WaterState::Paused:
            return "暂停";
        case WaterState::Error:
            return "异常";
    }
    return "未知";
}

const char* modeText(WaterMode mode) {
    switch (mode) {
        case WaterMode::Volume:
            return "容量";
        case WaterMode::Time:
            return "时间";
    }
    return "未知";
}

const char* resultText(WaterResult result) {
    switch (result) {
        case WaterResult::Completed:
            return "完成";
        case WaterResult::StoppedByUser:
            return "手动停止";
        case WaterResult::SafetyStopped:
            return "安全停止";
        case WaterResult::FlowError:
            return "流量异常";
        case WaterResult::PauseTimeout:
            return "暂停超时";
    }
    return "未知";
}

void sendVolumeInput(const char* label, const char* name, std::uint32_t value) {
    char liters[24]{};
    formatLiters(value, liters, sizeof(liters));
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>当前 %s</small></label>",
            label,
            name,
            static_cast<unsigned long>(value),
            liters);
}

void sendMonthInput(const char* label, const char* name, std::uint32_t days) {
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>按 30 天/月计算</small></label>",
            label,
            name,
            static_cast<unsigned long>(daysToMonths(days)));
}

