tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendDateInput(const char* label, const char* name, std::uint32_t seconds) {
    char date[16]{};
    formatDate(seconds >= kMinRealDateSeconds ? seconds : 0, date, sizeof(date));
    sendFmt("<label class='field'><span>%s</span><input type='date' name='%s' value='%s'></label>",
            label,
            name,
            date);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check-field'><span class='check-title'>%s</span><span class='check-line'><input type='checkbox' name='%s' value='1'%s>启用</span></label>",
            label,
            name,
            checked ? " checked" : "");
}

void formatMonthRange(const WaterUsageSummary& summary, char* out, std::size_t len) {
    if (!out || len == 0 || summary.monthStartDay == 0 || summary.todayDay == 0) {
        return;
    }
    std::uint16_t year = 0;
    std::uint8_t month = 0;
    std::uint8_t day = 0;
    dateFromDayIndex(summary.monthStartDay, year, month, day);
    std::uint16_t endYear = 0;
    std::uint8_t endMonth = 0;
    std::uint8_t endDay = 0;
    dateFromDayIndex(summary.todayDay, endYear, endMonth, endDay);
    std::snprintf(out,
                  len,
                  "%u 月 %u ~ %u 日",
                  static_cast<unsigned>(month),
                  static_cast<unsigned>(day),
                  static_cast<unsigned>(endDay));
}

void sendMachineTaskCard(const char* valueId, const char* metaId, const char* label, const char* value, const char* meta) {
    sendFmt("<div class='machine-task-card'><span>%s</span><strong id='%s'>%s</strong><small id='%s'%s>%s</small></div>",
            label,
            valueId,
            value,
            metaId,
            (meta && meta[0]) ? "" : " style='display:none'",
            meta);
}

void sendMachineTaskCard(const char* wrapperId,
                         const char* valueId,
                         const char* metaId,
                         const char* label,
                         const char* value,
                         const char* meta,
                         bool hidden) {
    sendFmt("<div id='%s' class='machine-task-card'%s><span>%s</span><strong id='%s'>%s</strong><small id='%s'%s>%s</small></div>",
            wrapperId,
            hidden ? " style='display:none'" : "",
            label,
            valueId,
            value,
            metaId,
            (meta && meta[0]) ? "" : " style='display:none'",
            meta);
}

void sendMachineStatusItem(const char* valueId,
                           const char* label,
                           const char* value,
                           const char* wrapperId = nullptr,
                           bool hidden = false) {
    if (wrapperId != nullptr) {
        sendFmt("<span id='%s' class='machine-status-item'%s><span>%s</span><strong id='%s'>%s</strong></span>",
                wrapperId,
                hidden ? " style='display:none'" : "",
                label,
                valueId,
                value);
        return;
    }
    sendFmt("<span class='machine-status-item'><span>%s</span><strong id='%s'>%s</strong></span>",
            label,
            valueId,
            value);
}

void sendMachineStatusItemNote(const char* valueId, const char* noteId, const char* label, const char* value, const char* note) {
    sendFmt("<span class='machine-status-item'><span>%s</span><strong id='%s'>%s</strong><small id='%s' class='machine-status-note'>%s</small></span>",
            label,
            valueId,
            value,
            noteId,
            note);
}

void sendMachineStatusSensorItem(const char* valueId, const char* label, const char* value, const char* unit) {
    sendFmt("<span class='machine-status-item'><span>%s</span><strong id='%s'>%s</strong><small class='sensor-unit'>%s</small></span>",
            label,
            valueId,
            value,
            unit);
}

void formatPresetTarget(const PresetConfig& preset, char* out, std::size_t len) {
    if (preset.type == PresetType::Time) {
        formatSecondsValue(preset.value, out, len);
        return;
    }
    formatLiters(preset.value, out, len);
}

void formatFlowLitersPerMinCompact(std::uint32_t flowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (flowMlPerMin == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out,
                  len,
                  "%lu.%03luL/min",
                  static_cast<unsigned long>(flowMlPerMin / 1000U),
                  static_cast<unsigned long>(flowMlPerMin % 1000U));
}

void formatPresetEstimate(const PresetConfig& preset,
                          const MeteringParameters& params,
                          std::uint32_t durationSec,
                          std::uint32_t timeVolumeMl,
                          std::uint32_t timePulseCount,
                          float stablePulsePerSec,
                          const char* reason,
                          char* out,
                          std::size_t len) {
    if (preset.type == PresetType::Time) {
        if (timeVolumeMl > 0 && timePulseCount > 0 && stablePulsePerSec > 0.0f) {
            char volume[24]{};
            char flow[24]{};
            formatLiters(timeVolumeMl, volume, sizeof(volume));
            formatFlowLitersPerMinCompact(params.stableFlowMlPerMin, flow, sizeof(flow));
            std::snprintf(out,
                          len,
                          "预计 %s · %luP · 稳态 %s",
                          volume,
                          static_cast<unsigned long>(timePulseCount),
                          flow);
        } else {
            std::snprintf(out, len, "%s", reason ? reason : "计量参数未就绪");
        }
        return;
    }
    const MeteringTargetEstimate estimate = meteringEstimateForTarget(params, preset.value);
    if (!estimate.valid) {
        std::snprintf(out, len, "%s", reason ? reason : "计量参数未就绪");
        return;
    }
    char duration[24]{};
    if (durationSec > 0) {
        formatSecondsValue(durationSec, duration, sizeof(duration));
        std::snprintf(out,
                      len,
                      "预计 %luP/L · %luP · 约 %s",
                      static_cast<unsigned long>(estimate.fullRunPulsePerLiter),
                      static_cast<unsigned long>(estimate.pulseCount),
                      duration);
    } else {
        std::snprintf(out,
                      len,
                      "预计 %luP/L · %luP",
                      static_cast<unsigned long>(estimate.fullRunPulsePerLiter),
                      static_cast<unsigned long>(estimate.pulseCount));
    }
}

std::uint32_t recordFlowMlPerMin(std::uint32_t volumeMl, std::uint32_t durationSec) {
    if (volumeMl == 0 || durationSec == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>((static_cast<std::uint64_t>(volumeMl) * 60ULL + durationSec / 2ULL) /
                                      durationSec);
}

std::uint32_t stableFlowMlPerMin(float stablePulsePerSec, const MeteringParameters& params) {
    if (stablePulsePerSec <= 0.0f || params.stablePulsePerLiter == 0) {
        return 0;
    }
    const double mlPerMin =
        static_cast<double>(stablePulsePerSec) * 60000.0 / static_cast<double>(params.stablePulsePerLiter);
    return mlPerMin <= 0.0 ? 0 : static_cast<std::uint32_t>(mlPerMin + 0.5);
}

void formatFlowLitersPerMin(std::uint32_t flowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (flowMlPerMin == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out,
                  len,
                  "%lu.%03lu L/min",
                  static_cast<unsigned long>(flowMlPerMin / 1000U),
                  static_cast<unsigned long>(flowMlPerMin % 1000U));
}

void formatFlowNumber(std::uint32_t flowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    const std::uint32_t centiLitersPerMin = (flowMlPerMin + 5U) / 10U;
    if (centiLitersPerMin == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out,
                  len,
                  "%lu.%02lu",
                  static_cast<unsigned long>(centiLitersPerMin / 100U),
                  static_cast<unsigned long>(centiLitersPerMin % 100U));
}

void formatFlowMeta(std::uint32_t runAverageFlowMlPerMin, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    char average[16]{};
    formatFlowNumber(runAverageFlowMlPerMin, average, sizeof(average));
    std::snprintf(out, len, "L/min · 本次平均 %s", average);
}

void sendNextPresetControl(const AppSnapshot& snapshot) {
    const SystemConfig& config = *g_context.config;
    const bool available = snapshot.water.selectedPreset < kPresetCount && config.presets[snapshot.water.selectedPreset].enabled;
    char target[24]{};
    char estimate[160]{};
    Esp32BaseWeb::sendChunk("<div id='nextPresetControl' class='next-preset-control'>"
                            "<button class='preset-step' type='button' aria-label='上一个预设' data-action='action=select_previous' onclick=\"faucetSelectPreset('select_previous')\">‹</button>"
                            "<div class='next-preset-copy'><span>下次预设</span><strong id='nextPresetLabel'>");
    if (available) {
        const PresetConfig& preset = config.presets[snapshot.water.selectedPreset];
        formatPresetTarget(preset, target, sizeof(target));
        sendFmt("P%u · ", static_cast<unsigned>(snapshot.water.selectedPreset + 1U));
        sendHtmlEscapedBounded(preset.name[0] ? preset.name : "未命名", sizeof(preset.name));
        sendFmt(" · %s", target);
        formatPresetEstimate(preset,
                             snapshot.meteringParams,
                             snapshot.selectedPresetEstimatedDurationSec,
                             snapshot.selectedPresetEstimatedVolumeMl,
                             snapshot.selectedPresetEstimatedPulseCount,
                             snapshot.selectedPresetStablePulsePerSec,
                             snapshot.selectedPresetEstimateReason,
                             estimate,
                             sizeof(estimate));
    } else {
        Esp32BaseWeb::sendChunk("无可用预设");
        std::snprintf(estimate, sizeof(estimate), "请先在预设页启用至少一项");
    }
    sendFmt("</strong><small id='nextPresetEstimate'%s>%s</small></div>"
            "<button class='preset-step' type='button' aria-label='下一个预设' data-action='action=select_next' onclick=\"faucetSelectPreset('select_next')\">›</button>"
            "</div>",
            estimate[0] ? "" : " style='display:none'",
            estimate);
}

const char* machineStatusNote(const AppSnapshot& snapshot) {
    switch (snapshot.water.state) {
        case WaterState::Idle:
            return "设备可用，等待按键启动";
        case WaterState::Confirm:
            return "等待确认，确认后开始出水";
        case WaterState::Running:
            return "正在出水，请留意容器";
        case WaterState::Paused:
            return "已暂停，等待继续或取消";
        case WaterState::Error:
            return resultText(snapshot.water.lastResult);
    }
    return "状态未知";
}

void sendMachineStatusCard(const AppSnapshot& snapshot, bool screenOn) {
    const bool shouldShowProgress = snapshot.water.state == WaterState::Running ||
                                    snapshot.water.state == WaterState::Paused ||
                                    snapshot.water.state == WaterState::Confirm;
    char targetValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        formatSecondsValue(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    } else {
        formatLiters(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    }
    char outValue[24]{};
    formatLiters(snapshot.water.volumeMl, outValue, sizeof(outValue));
    const std::uint32_t progressBase = snapshot.water.mode == WaterMode::Time ? snapshot.water.elapsedSec : snapshot.water.volumeMl;
    const std::uint32_t progressPercent = percentOf(progressBase, snapshot.water.targetValue);
    char progressText[48]{};
    if (snapshot.water.mode == WaterMode::Time) {
        char elapsed[20]{};
        formatSecondsValue(snapshot.water.elapsedSec, elapsed, sizeof(elapsed));
        std::snprintf(progressText, sizeof(progressText), "%s / %s", elapsed, targetValue);
    } else {
        std::snprintf(progressText, sizeof(progressText), "%s / %s", outValue, targetValue);
    }
    const std::uint32_t remaining =
        snapshot.water.mode == WaterMode::Time
            ? (snapshot.water.targetValue > snapshot.water.elapsedSec ? snapshot.water.targetValue - snapshot.water.elapsedSec : 0)
            : (snapshot.water.targetValue > snapshot.water.volumeMl ? snapshot.water.targetValue - snapshot.water.volumeMl : 0);
    char remainingValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        formatSecondsValue(remaining, remainingValue, sizeof(remainingValue));
    } else {
        formatLiters(remaining, remainingValue, sizeof(remainingValue));
    }
    char elapsedText[24]{};
    formatSecondsValue(snapshot.water.elapsedSec, elapsedText, sizeof(elapsedText));
    char targetMeta[96]{};
    if (snapshot.water.mode == WaterMode::Volume) {
        const MeteringTargetEstimate targetEstimate =
            meteringEstimateForTarget(snapshot.meteringParams, snapshot.water.targetValue);
        char durationText[24]{};
        if (!targetEstimate.valid) {
            std::snprintf(targetMeta,
                          sizeof(targetMeta),
                          "%s",
                          snapshot.targetEstimateReason ? snapshot.targetEstimateReason : "计量参数未就绪");
        } else if (snapshot.targetEstimatedDurationSec > 0) {
            formatSecondsValue(snapshot.targetEstimatedDurationSec, durationText, sizeof(durationText));
            std::snprintf(targetMeta,
                          sizeof(targetMeta),
                          "预计约 %s",
                          durationText);
        } else {
            std::snprintf(targetMeta, sizeof(targetMeta), "计量参数未就绪");
        }
    } else if (snapshot.targetEstimatedVolumeMl > 0 && snapshot.targetEstimatedPulseCount > 0 &&
               snapshot.targetStablePulsePerSec > 0.0f) {
        char estimatedVolume[24]{};
        formatLiters(snapshot.targetEstimatedVolumeMl, estimatedVolume, sizeof(estimatedVolume));
        std::snprintf(targetMeta, sizeof(targetMeta), "预计 %s", estimatedVolume);
    } else {
        std::snprintf(targetMeta,
                      sizeof(targetMeta),
                      "%s",
                      snapshot.targetEstimateReason ? snapshot.targetEstimateReason : "计量参数未就绪");
    }
    char outputMeta[32]{};
    std::snprintf(outputMeta, sizeof(outputMeta), "已运行 %s", elapsedText);
    char remainingMeta[24]{};
    std::snprintf(remainingMeta, sizeof(remainingMeta), "完成 %lu%%", static_cast<unsigned long>(progressPercent));
    char currentFlow[24]{};
    formatFlowNumber(snapshot.currentFlowMlPerMin, currentFlow, sizeof(currentFlow));
    char currentFlowMeta[40]{};
    formatFlowMeta(snapshot.runAverageFlowMlPerMin, currentFlowMeta, sizeof(currentFlowMeta));
    char droppedPulses[24]{};
    std::snprintf(droppedPulses, sizeof(droppedPulses), "%lu", static_cast<unsigned long>(snapshot.flowDroppedPulses));
    char valvePwmDuty[12]{};
    std::snprintf(valvePwmDuty, sizeof(valvePwmDuty), "%u%%", static_cast<unsigned>(snapshot.valve.dutyPercent));
    char valvePwmNote[32]{};
    std::snprintf(valvePwmNote,
                  sizeof(valvePwmNote),
                  "%lus全功率→%u%%保持",
                  static_cast<unsigned long>(g_context.config->valveFullPowerSec),
                  static_cast<unsigned>(g_context.config->valveHoldDutyPercent));
    char currentTemperature[24]{};
    if (snapshot.temperatureSensorEnabled && snapshot.sensors.temperatureCentiC.valid) {
        formatSensorTemperatureNumber(snapshot.sensors.temperatureCentiC, currentTemperature, sizeof(currentTemperature));
    } else {
        std::snprintf(currentTemperature, sizeof(currentTemperature), "--");
    }
    char currentTds[24]{};
    if (snapshot.tdsSensorEnabled && snapshot.sensors.tdsPpm.valid) {
        formatSensorIntegerNumber(snapshot.sensors.tdsPpm, currentTds, sizeof(currentTds));
    } else {
        std::snprintf(currentTds, sizeof(currentTds), "--");
    }

    const bool showResult = snapshot.water.state == WaterState::Error || snapshot.localMode == LocalUiMode::Result;
    const bool showRunningNote = snapshot.water.state == WaterState::Running;
    const char* machineLayoutClass = shouldShowProgress ? "machine-main" : "machine-main compact";
    sendFmt("<h2>机器状态</h2><section class='panel machine-status'><div class='%s'><div class='machine-hero'>"
            "<div class='machine-hero-head'><strong>",
            machineLayoutClass);
    Esp32BaseWeb::sendChunk("<span id='machineState'>");
    Esp32BaseWeb::sendChunk(stateText(snapshot.water.state));
    Esp32BaseWeb::sendChunk("</span></strong><div class='machine-context'>");
    sendNextPresetControl(snapshot);
    Esp32BaseWeb::sendChunk("</div></div>");
    sendFmt("<div id='machineProgress' class='machine-progress'%s><div class='machine-progress-head'><span>出水进度</span><strong id='machineProgressText'>%s</strong></div>"
            "<div class='progress'><span id='machineProgressBar' style='width:%lu%%'></span></div>"
            "<p id='machineStatusNote' class='machine-alert machine-progress-alert'%s>%s</p></div>",
            shouldShowProgress ? "" : " style='display:none'",
            progressText,
            static_cast<unsigned long>(progressPercent),
            showRunningNote ? "" : " style='display:none'",
            machineStatusNote(snapshot));
    sendFmt("<span class='machine-screen-footer'><span>屏幕</span><span id='screenStatus'>%s</span></span>",
            screenOn ? "亮屏" : "休眠");
    Esp32BaseWeb::sendChunk("</div><div class='machine-overview'><div class='machine-task-grid'>");
    sendMachineTaskCard("targetValue", "targetMeta", "目标", targetValue, targetMeta);
    sendMachineTaskCard("outputValue", "outputMeta", "已出水", outValue, outputMeta);
    sendMachineTaskCard("remainingValue", "remainingMeta", "剩余", remainingValue, remainingMeta);
    sendMachineTaskCard("currentFlowCard", "currentFlowValue", "currentFlowMeta", "流速", currentFlow, currentFlowMeta, false);
    Esp32BaseWeb::sendChunk("</div><div class='machine-status-strip'>");
    sendMachineStatusItem("valveStatus", "阀门", snapshot.water.valveOpen ? "开" : "关");
    sendMachineStatusSensorItem("temperatureStatus", "水温", currentTemperature, "C");
    sendMachineStatusSensorItem("tdsStatus", "TDS", currentTds, "ppm");
    sendMachineStatusItemNote("valvePwmDuty", "valvePwmNote", "PWM", valvePwmDuty, valvePwmNote);
    sendMachineStatusItem("resultStatus", "结果", resultText(snapshot.water.lastResult), "resultItem", !showResult);
    sendMachineStatusItem("droppedPulses", "丢弃脉冲", droppedPulses, "droppedPulsesItem", snapshot.flowDroppedPulses == 0);
    Esp32BaseWeb::sendChunk("</div></div></div></section>");
}

TodayOverview collectTodayOverview(std::uint32_t now, std::uint32_t fallbackTodayMl) {
    TodayOverview overview{};
    overview.volumeMl = fallbackTodayMl;
    if (!g_context.records || !g_context.records->ready() || now < kMinRealDateSeconds || waterTaskActive()) {
        return overview;
    }
    overview.timeReady = true;
    const std::uint32_t todayStart = (now / 86400UL) * 86400UL;
    std::unique_ptr<WaterRecord[]> records(new (std::nothrow) WaterRecord[kDefaultRecordPageSize]{});
    if (!records) {
        return overview;
    }
    const std::size_t total = g_context.records->count();
    bool stopAfterPage = false;
    for (std::size_t offset = 0; offset < total && !stopAfterPage; offset += kDefaultRecordPageSize) {
        const std::size_t page = offset / kDefaultRecordPageSize;
        const std::size_t read =
            g_context.records->readPage(page, kDefaultRecordPageSize, records.get(), kDefaultRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (!waterRecordHasRealTime(records[i])) {
                continue;
            }
            if (records[i].startTime > now) {
                continue;
            }
            if (records[i].startTime < todayStart) {
                stopAfterPage = true;
                break;
            }
            ++overview.count;
            overview.durationSec += records[i].durationSec;
            if (overview.latestCount < kHomeTodayRecordLimit) {
                overview.latest[overview.latestCount++] = records[i];
            }
        }
    }
    return overview;
}

