tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleRecordInfoPage() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    char text[24]{};
    WaterRecord record{};
    std::uint32_t parsed = 0;
    std::int16_t parsedI16 = 0;
    if (getParam("start", text, sizeof(text)) && parseU32(text, parsed)) {
        record.startTime = parsed;
    }
    if (getParam("boot", text, sizeof(text)) && parseU32(text, parsed)) {
        markWaterRecordBootId(record, parsed);
    }
    if (getParam("volume", text, sizeof(text)) && parseU32(text, parsed)) {
        record.volumeMl = parsed;
    }
    if (getParam("target", text, sizeof(text)) && parseU32(text, parsed)) {
        record.targetValue = parsed;
    }
    if (getParam("pulses", text, sizeof(text)) && parseU32(text, parsed)) {
        record.pulseCount = parsed;
    }
    if (getParam("rejected", text, sizeof(text)) && parseU32(text, parsed)) {
        record.rejectedPulseCount = parsed;
    }
    if (getParam("duration", text, sizeof(text)) && parseU32(text, parsed)) {
        record.durationSec = parsed;
    }
    if (getParam("mode", text, sizeof(text)) && parseU32(text, parsed)) {
        record.mode = parsed == static_cast<std::uint32_t>(WaterMode::Time) ? WaterMode::Time : WaterMode::Volume;
    }
    if (getParam("result", text, sizeof(text)) && parseU32(text, parsed)) {
        record.result = static_cast<WaterResult>(parsed);
    }
    if (getParam("preset", text, sizeof(text)) && parseU32(text, parsed)) {
        record.selectedPreset = static_cast<std::uint8_t>(parsed);
    }
    if (getParam("tempAvg", text, sizeof(text)) && parseI16(text, parsedI16)) {
        record.temperatureAvgCentiC = parsedI16;
    }
    if (getParam("tempMin", text, sizeof(text)) && parseI16(text, parsedI16)) {
        record.temperatureMinCentiC = parsedI16;
    }
    if (getParam("tempMax", text, sizeof(text)) && parseI16(text, parsedI16)) {
        record.temperatureMaxCentiC = parsedI16;
    }
    if (getParam("tdsAvg", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsAvgPpm = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("tdsMin", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsMinPpm = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("tdsMax", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsMaxPpm = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("tdsMv", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsVoltageAvgMv = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("sensorSamples", text, sizeof(text)) && parseU32(text, parsed)) {
        record.sensorSampleCount = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("sensorFlags", text, sizeof(text)) && parseU32(text, parsed)) {
        record.sensorFlags = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("tdsRev", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsCalibrationRevisionAtRun = static_cast<std::uint16_t>(parsed);
    }
    if (getParam("tdsMode", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsCalibrationModeAtRun = static_cast<std::uint8_t>(parsed);
    }
    if (getParam("tdsCal", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsCalibratedAtRun = static_cast<std::uint8_t>(parsed);
    }
    if (getParam("tdsComp", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsTemperatureCompensatedAtRun = static_cast<std::uint8_t>(parsed);
    }
    if (getParam("tdsFallback", text, sizeof(text)) && parseU32(text, parsed)) {
        record.tdsTempFallback25CAtRun = static_cast<std::uint8_t>(parsed);
    }
    if (getParam("scheme", text, sizeof(text)) && parseU32(text, parsed)) {
        record.meteringSchemeId = parsed;
    }
    char startTime[40]{};
    formatWaterRecordListTime(record, startTime, sizeof(startTime));
    char duration[24]{};
    formatSecondsValue(record.durationSec, duration, sizeof(duration));
    char averageFlow[24]{};
    formatFlowLitersPerMin(recordFlowMlPerMin(record.volumeMl, record.durationSec), averageFlow, sizeof(averageFlow));
    char task[64]{};
    formatRecordPresetLabel(record, task, sizeof(task));
    sendPageStart("接水详情");
    Esp32BaseWeb::sendChunk("<h2>接水详情</h2><div class='form-actions'><a class='btn-link' href='/faucet/records'>返回记录</a></div>"
                            "<div class='record-detail-grid'><section class='panel record-detail-card'><h3>出水结果</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>"
            "<tr><th>持续时间</th><td>%s</td></tr>"
            "<tr><th>结果</th><td><span class='status-pill %s'>%s</span></td></tr>",
            startTime,
            duration,
            resultStatusClass(record.result),
            resultText(record.result));
    sendFmt("</table></section>"
            "<section class='panel record-detail-card'><h3>任务与出水</h3><table class='kv'>"
            "<tr><th>任务</th><td>%s</td></tr>"
            "<tr><th>目标值</th><td>",
            task);
    sendTargetValue(record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>估算出水</th><td>");
    sendLiters(record.volumeMl);
    sendFmt("</td></tr><tr><th>平均流速</th><td>%s</td></tr></table></section>", averageFlow);
    sendWaterRecordSensorRows(record);
    Esp32BaseWeb::sendChunk("<section class='panel record-detail-card'><h3>计量与脉冲</h3><table class='kv'>");
    sendFmt("<tr><th>有效脉冲</th><td>%lu P</td></tr>"
            "<tr><th>被过滤脉冲</th><td>%lu P</td></tr>",
            static_cast<unsigned long>(record.pulseCount),
            static_cast<unsigned long>(record.rejectedPulseCount));
    MeteringSchemeRecord meteringScheme{};
    if (ensureMeteringSchemesReady() && g_context.meteringSchemes->findById(record.meteringSchemeId, meteringScheme)) {
        char startupDuration[24]{};
        formatStartupDurationSeconds(meteringScheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
        Esp32BaseWeb::sendChunk("<tr><th>计量方案</th><td>");
        if (meteringScheme.name[0]) {
            sendHtmlEscapedBounded(meteringScheme.name, sizeof(meteringScheme.name));
        } else {
            sendFmt("计量方案 %lu", static_cast<unsigned long>(record.meteringSchemeId));
        }
        sendFmt("<span class='inline-note'>ID #%lu</span></td></tr>"
                "<tr><th>启动脉冲数</th><td>%lu P</td></tr>"
                "<tr><th>启动水量</th><td>%lu ml</td></tr>"
                "<tr><th>稳态 P/L</th><td>%lu P/L</td></tr>"
                "<tr><th>启动时长</th><td>%s</td></tr>"
                "<tr><th>预计稳态流速</th><td>%lu ml/min</td></tr>",
                static_cast<unsigned long>(meteringScheme.id),
                static_cast<unsigned long>(meteringScheme.params.startupPulseCount),
                static_cast<unsigned long>(meteringScheme.params.startupVolumeMl),
                static_cast<unsigned long>(meteringScheme.params.stablePulsePerLiter),
                startupDuration,
                static_cast<unsigned long>(meteringScheme.params.stableFlowMlPerMin));
        if (record.mode == WaterMode::Volume) {
            const MeteringTargetEstimate targetEstimate =
                meteringEstimateForTarget(meteringScheme.params, record.targetValue);
            if (targetEstimate.valid) {
                sendFmt("<tr><th>目标预计总脉冲</th><td>%lu P</td></tr>"
                        "<tr><th>目标全程平均 P/L</th><td>%lu P/L</td></tr>",
                        static_cast<unsigned long>(targetEstimate.pulseCount),
                        static_cast<unsigned long>(targetEstimate.fullRunPulsePerLiter));
            }
        }
    } else if (record.meteringSchemeId != 0) {
        sendFmt("<tr><th>计量方案</th><td>计量方案 ID #%lu 已被覆盖，历史参数不可查看</td></tr>",
                static_cast<unsigned long>(record.meteringSchemeId));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>计量方案</th><td>记录格式不兼容，历史参数不可查看</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section></div>");
    sendPageEnd();
}

void handleCalibrationPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (!requireContext()) {
        return;
    }
    char view[24]{};
    if (getParam("view", view, sizeof(view))) {
        if (std::strcmp(view, "temperature") == 0) {
            handleTemperatureCalibrationPage();
            return;
        }
        if (std::strcmp(view, "tds") == 0) {
            handleTdsCalibrationPage();
            return;
        }
    }

    const AppSnapshot snapshot = g_context.app->snapshot();
    if (!calibrationSessionInactive(snapshot.calibrationStatus)) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow");
        return;
    }

    Esp32BaseWeb::sendHeader("校准");
    Esp32BaseWeb::sendChunk("<h2>校准</h2>");
    sendNoticeFromQuery();

    sendCalibrationCenterFlowCard(snapshot);
    sendCalibrationCenterTemperatureCard(snapshot, *g_context.config);
    sendCalibrationCenterTdsCard(snapshot, *g_context.config);
    sendCalibrationPageScript();
    sendPageEnd();
}

