tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleFlowCalibrationPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (!requireContext()) {
        return;
    }
    char text[32]{};
    if (getParam("partial", text, sizeof(text))) {
        if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
            return;
        }
        if (std::strcmp(text, "schemes") == 0) {
            sendCalibrationParameterPanels();
        } else if (std::strcmp(text, "session") == 0) {
            sendFlowCalibrationSessionPanel(g_context.app->snapshot(), waterTaskActive());
        } else if (std::strcmp(text, "samples") == 0) {
            sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
        }
        Esp32BaseWeb::endResponse();
        return;
    }
    if (getParam("manual", text, sizeof(text))) {
        MeteringParameters prefill{};
        bool hasPrefill = false;
        if (!readMeteringManualPrefillFromQuery(prefill, hasPrefill)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
            return;
        }
        MeteringSchemeRecord draft{};
        if (hasPrefill) {
            char name[kMeteringSchemeNameLength]{};
            const char* prefillName = getParam("name", name, sizeof(name)) && name[0] ? name : "手工参数";
            initializeManualMeteringScheme(draft, 0, prefillName, prefill, g_context.nowSeconds ? g_context.nowSeconds() : 0);
        }
        sendManualMeteringParameterPage(hasPrefill ? &draft : nullptr);
        return;
    }
    if (getParam("scheme", text, sizeof(text))) {
        if (std::strcmp(text, "new") == 0) {
            sendManualMeteringParameterPage(nullptr);
            return;
        }
        std::uint32_t id = 0;
        MeteringSchemeRecord scheme{};
        if (!parseU32(text, id) || !ensureMeteringSchemesReady() || !g_context.meteringSchemes->findById(id, scheme)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
            return;
        }
        sendManualMeteringParameterPage(&scheme);
        return;
    }

    const AppSnapshot snapshot = g_context.app->snapshot();
    const bool taskActive = waterTaskActive();

    Esp32BaseWeb::sendHeader("流量计校准");
    Esp32BaseWeb::sendChunk("<h2>流量计校准</h2>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<p class='muted'>本页负责录入实测容量、管理样本和应用参数；出水与停水只能在设备本地按键完成。</p>");
    sendFlowCalibrationSessionPanel(snapshot, taskActive);
    sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
    Esp32BaseWeb::sendChunk("<div class='calibration-param-layout'>");
    sendActiveMeteringSchemeSummaryPanel();
    Esp32BaseWeb::sendChunk("</div>");
    sendCalibrationParameterPanels();
    sendCalibrationPageScript();
    sendPageEnd();
}

void sendDetailErrorPage(const char* title, const char* message, const char* backHref, const char* backLabel) {
    Esp32BaseWeb::sendHeader(title);
    sendFmt("<h2>%s</h2><p class='err'>%s</p>", title ? title : "详情", message ? message : "请求无效。");
    if (backHref && backLabel) {
        sendFmt("<p><a class='btn-link' href='%s'>%s</a></p>", backHref, backLabel);
    }
    sendPageEnd();
}

void handleCalibrationDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    char text[24]{};
    constexpr const char* backHref = "/faucet/calibration";
    constexpr const char* backLabel = "返回校准";
    constexpr const char* detailPath = "/faucet/calibration/detail";

    if (!contextReady()) {
        sendDetailErrorPage("脉冲明细", "上下文未就绪。", nullptr, nullptr);
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("record_detail");
        return;
    }

    bool useSessionTrace = false;
    std::uint32_t sessionTraceSlot = 0;
    std::uint32_t traceId = 0;
    if (getParam("slot", text, sizeof(text))) {
        useSessionTrace = parseU32(text, sessionTraceSlot) && sessionTraceSlot < kCalibrationSessionTraceSlots;
    }
    if (!useSessionTrace && (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId))) {
        sendDetailErrorPage("脉冲明细", "明细编号无效。", backHref, backLabel);
        return;
    }

    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }

    const WaterPulseTrace* trace = nullptr;
    WaterPulseTrace sessionTrace{};
    std::unique_ptr<WaterPulseTraceBucketSample[]> buckets;
    std::unique_ptr<WaterPulseTraceSample[]> startupEdges;
    std::size_t loadedBucketCount = 0;
    std::size_t loadedStartupEdgeCount = 0;

    if (useSessionTrace) {
        if (!g_context.calibrationSessionTraces || !g_context.calibrationSessionTraces->ready()) {
            sendDetailErrorPage("脉冲明细", "校准会话脉冲数据不可用。", backHref, backLabel);
            return;
        }
        CalibrationStoredTrace stored{};
        if (!g_context.calibrationSessionTraces->load(static_cast<std::uint8_t>(sessionTraceSlot), stored)) {
            sendDetailErrorPage("脉冲明细", "该校准会话脉冲明细不存在。", backHref, backLabel);
            return;
        }
        sessionTrace = stored.trace;
        trace = &sessionTrace;
        traceId = trace->traceId;
        if (trace->bucketCount > 0) {
            buckets.reset(new (std::nothrow) WaterPulseTraceBucketSample[trace->bucketCount]{});
            if (buckets) {
                loadedBucketCount = g_context.calibrationSessionTraces->readBuckets(
                    static_cast<std::uint8_t>(sessionTraceSlot), buckets.get(), trace->bucketCount);
            }
        }
        if (trace->startupEdgeCount > 0) {
            startupEdges.reset(new (std::nothrow) WaterPulseTraceSample[trace->startupEdgeCount]{});
            if (startupEdges) {
                loadedStartupEdgeCount = g_context.calibrationSessionTraces->readStartupEdges(
                    static_cast<std::uint8_t>(sessionTraceSlot), startupEdges.get(), trace->startupEdgeCount);
            }
        }
    } else {
        if (!g_context.pulseTraces) {
            sendDetailErrorPage("脉冲明细", "脉冲明细缓存不可用。", backHref, backLabel);
            return;
        }
        trace = g_context.pulseTraces->findById(traceId);
        if (trace && trace->bucketCount > 0) {
            buckets.reset(new (std::nothrow) WaterPulseTraceBucketSample[trace->bucketCount]{});
            if (buckets) {
                for (std::size_t i = 0; i < trace->bucketCount; ++i) {
                    const WaterPulseTraceBucketSample* bucket = g_context.pulseTraces->bucketAt(*trace, i);
                    buckets[i] = bucket ? *bucket : WaterPulseTraceBucketSample{};
                }
                loadedBucketCount = trace->bucketCount;
            }
        }
        if (trace && trace->startupEdgeCount > 0) {
            startupEdges.reset(new (std::nothrow) WaterPulseTraceSample[trace->startupEdgeCount]{});
            if (startupEdges) {
                for (std::size_t i = 0; i < trace->startupEdgeCount; ++i) {
                    const WaterPulseTraceSample* edge = g_context.pulseTraces->startupEdgeAt(*trace, i);
                    startupEdges[i] = edge ? *edge : WaterPulseTraceSample{};
                }
                loadedStartupEdgeCount = trace->startupEdgeCount;
            }
        }
    }

    if (!trace) {
        sendDetailErrorPage("脉冲明细", "该脉冲明细不存在。", backHref, backLabel);
        return;
    }
    if ((trace->bucketCount > 0 && (!buckets || loadedBucketCount != trace->bucketCount)) ||
        (trace->startupEdgeCount > 0 && (!startupEdges || loadedStartupEdgeCount != trace->startupEdgeCount))) {
        sendDetailErrorPage("脉冲明细", "内存不足，无法读取脉冲明细。", nullptr, nullptr);
        return;
    }

    char detailSourceParam[32]{};
    if (useSessionTrace) {
        std::snprintf(detailSourceParam, sizeof(detailSourceParam), "slot=%u", static_cast<unsigned>(sessionTraceSlot));
    } else {
        std::snprintf(detailSourceParam, sizeof(detailSourceParam), "trace=%lu", static_cast<unsigned long>(traceId));
    }
    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));

