tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    SystemConfig* safe = new (std::nothrow) SystemConfig(g_context.configStore->loadSystemConfig());
    if (!safe) {
        return false;
    }
    safe->filters[index] = record;
    sanitizeConfig(*safe);

    FilterRecord runtime[kFilterCount]{};
    const FilterRecord* current = g_context.filters->records();
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        runtime[i] = current[i];
    }
    runtime[index].startTime = record.startTime;
    runtime[index].usedMl = record.usedMl;
    runtime[index].startBootId = record.startBootId;

    if (!g_context.configStore->saveSystemConfig(*safe) || !g_context.configStore->saveFilterRuntime(runtime)) {
        delete safe;
        return false;
    }
    FilterRecord liveRecord = safe->filters[index];
    liveRecord.startTime = runtime[index].startTime;
    liveRecord.usedMl = runtime[index].usedMl;
    liveRecord.startBootId = runtime[index].startBootId;
    if (!g_context.app->applyConfig(*safe) || !g_context.filters->updateFilter(index, liveRecord)) {
        delete safe;
        return false;
    }
    *g_context.config = *safe;
    delete safe;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    return true;
}

void sendCurrentStatusJson() {
    const FaucetDisplayStatus displayStatus =
        g_context.currentDisplayStatus
            ? g_context.currentDisplayStatus()
            : FaucetDisplayStatus{false};
    const ConfigRuntimeStatus configStatus{
        configLoadStatusName(g_context.configStore->lastSystemConfigLoadStatus()),
        g_context.configStore->lastSystemConfigRawVersion(),
        g_context.configStore->currentSystemConfigVersion(),
    };
    AppSnapshot snapshot = g_context.app->snapshot();
    applyTargetDurationEstimate(snapshot, false);
    static char json[4096]{};
    json[0] = '\0';
    sendJsonBuffer(
        writeStatusJson(snapshot, displayStatus.screenOn, *g_context.config, &configStatus, json, sizeof(json)),
        json);
}

const char* calibrationSessionStatusText(CalibrationSessionStatus status) {
    switch (status) {
        case CalibrationSessionStatus::Idle:
            return "未开始";
        case CalibrationSessionStatus::Preparing:
            return "准备中";
        case CalibrationSessionStatus::WaitingLocalRun:
            return "等待本地出水";
        case CalibrationSessionStatus::Running:
            return "本地出水中";
        case CalibrationSessionStatus::AwaitingActual:
            return "等待输入实际容量";
        case CalibrationSessionStatus::ReadyToGenerate:
            return "可生成";
        case CalibrationSessionStatus::Generated:
            return "已生成，待应用";
        case CalibrationSessionStatus::Applied:
            return "已应用";
        case CalibrationSessionStatus::Discarded:
            return "已放弃";
        case CalibrationSessionStatus::Failed:
            return "失败";
    }
    return "未知";
}

bool calibrationSessionInactive(CalibrationSessionStatus status) {
    return status == CalibrationSessionStatus::Idle || status == CalibrationSessionStatus::Applied ||
           status == CalibrationSessionStatus::Discarded || status == CalibrationSessionStatus::Failed;
}

bool calibrationSessionStorageReady() {
    if (!g_context.calibrationSessions || !g_context.calibrationSessionTraces) {
        return false;
    }
    if (!g_context.calibrationSessions->ready() && !g_context.calibrationSessions->begin()) {
        return false;
    }
    if (!g_context.calibrationSessionTraces->ready() && !g_context.calibrationSessionTraces->begin()) {
        return false;
    }
    return g_context.calibrationSessions->ready() && g_context.calibrationSessionTraces->ready();
}

void redirectCalibrationFailure(const char* error) {
    char url[96]{};
    std::snprintf(url, sizeof(url), "/faucet/calibration?error=%s", error ? error : "save_failed");
    Esp32BaseWeb::redirectSeeOther(url);
}

void redirectFlowCalibrationFailure(const char* error) {
    char url[112]{};
    std::snprintf(url, sizeof(url), "/faucet/calibration/flow?error=%s", error ? error : "save_failed");
    Esp32BaseWeb::redirectSeeOther(url);
}

void redirectFlowCalibrationResult(bool ok, const char* success, const char* failure) {
    if (ok) {
        char url[112]{};
        std::snprintf(url, sizeof(url), "/faucet/calibration/flow?saved=%s", success ? success : "1");
        Esp32BaseWeb::redirectSeeOther(url);
    } else {
        redirectFlowCalibrationFailure(failure);
    }
}

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    sendCurrentStatusJson();
}

void handleTodayOverviewApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (waterTaskActive()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\"}");
        return;
    }
    if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
        return;
    }
    const AppSnapshot snapshot = g_context.app->snapshot();
    sendTodayOverview(collectTodayOverview(g_context.nowSeconds(), snapshot.statistics.todayMl));
    Esp32BaseWeb::endResponse();
}

void handlePresetsApi() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("faucet_presets") || !requireContext()) {
            return;
        }
        char text[24]{};
        if (getParam("action", text, sizeof(text))) {
            bool ok = false;
            if (std::strcmp(text, "select_previous") == 0) {
                ok = g_context.app->selectPreviousPresetForWeb();
            } else if (std::strcmp(text, "select_next") == 0) {
                ok = g_context.app->selectNextPresetForWeb();
            } else {
                std::uint32_t index = 0;
                if (std::strcmp(text, "select") == 0 && getParam("index", text, sizeof(text)) &&
                    parseU32(text, index)) {
                    ok = g_context.app->selectPresetForWeb(index);
                } else {
                    Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_action\"}");
                    return;
                }
            }
            if (!ok) {
                Esp32BaseWeb::sendJson(409, "{\"error\":\"preset_unavailable\"}");
                return;
            }
            sendCurrentStatusJson();
            return;
        }
        const bool browserForm = Esp32BaseWeb::hasParam("return");
        if (!g_context.app->canApplyConfig()) {
            if (browserForm) {
                Esp32BaseWeb::redirectSeeOther("/faucet/presets?error=busy");
                return;
            }
            Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\",\"restartRecommended\":true}");
            return;
        }
        std::uint32_t index = 0;
        if (!getParam("index", text, sizeof(text)) || !parseU32(text, index) || index >= kPresetCount) {
            if (browserForm) {
                Esp32BaseWeb::redirectSeeOther("/faucet/presets?error=invalid_index");
                return;
            }
            Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_index\"}");
            return;
        }
        SystemConfig* candidate = new (std::nothrow) SystemConfig(*g_context.config);
        if (!candidate) {
            if (browserForm) {
                Esp32BaseWeb::redirectSeeOther("/faucet/presets?error=save_failed");
                return;
            }
            Esp32BaseWeb::sendJson(500, "{\"error\":\"oom\"}");
            return;
        }
        PresetConfig& preset = candidate->presets[index];
        preset.enabled = checkboxParam("enabled");
        if (getParam("type", text, sizeof(text))) {
            preset.type = std::strcmp(text, "time") == 0 ? PresetType::Time : PresetType::Volume;
        }
        std::uint32_t value = 0;
        const bool validValue = getParam("value", text, sizeof(text)) && parseU32(text, value) &&
                                ((preset.type == PresetType::Time && value >= kMinTimePresetSec &&
                                  value <= kMaxTimePresetSec) ||
                                 (preset.type == PresetType::Volume && value >= kMinVolumePresetMl &&
                                  value <= kMaxVolumePresetMl));
        if (!validValue) {
            delete candidate;
            if (browserForm) {
                char location[80]{};
                std::snprintf(location,
                              sizeof(location),
                              "/faucet/presets?index=%lu&error=invalid_value",
                              static_cast<unsigned long>(index));
                Esp32BaseWeb::redirectSeeOther(location);
                return;
            }
            Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_value\"}");
            return;
        }
        preset.value = value;
        Esp32BaseWeb::getParam("name", preset.name, sizeof(preset.name));
        if (browserForm) {
            const bool ok = persistConfig(*candidate);
            delete candidate;
            Esp32BaseWeb::redirectSeeOther(ok ? "/faucet/presets?saved=1" : "/faucet/presets?error=save_failed");
        } else {
            saveConfigAndReply(*candidate);
            delete candidate;
        }
        return;
    }
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    char json[1536]{};
    sendJsonBuffer(writePresetsJson(g_context.config->presets, json, sizeof(json)), json);
}

void handleRecordsApi() {
    char text[32]{};
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("faucet_records") || !requireContext()) {
            return;
        }
        if (!getParam("action", text, sizeof(text))) {
            Esp32BaseWeb::sendJson(400, "{\"error\":\"missing_action\"}");
            return;
        }
        Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_action\"}");
        return;
    }
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("records_api");
        return;
    }
    std::uint32_t page = 0;
    std::uint32_t pageSize = kDefaultRecordPageSize;
    if (getParam("page", text, sizeof(text))) {
        parseU32(text, page);
    }
    if (getParam("pageSize", text, sizeof(text))) {
        parseU32(text, pageSize);
    }
    if (pageSize > kMaxRecordPageSize) {
        pageSize = kMaxRecordPageSize;
    }
    WaterRecordFilter filter{};
    char dateText[16]{};
    if ((getParam("startDate", dateText, sizeof(dateText)) || getParam("from", dateText, sizeof(dateText)))) {
        if (!parseDate(dateText, filter.startTime)) {
            Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_date\"}");
            return;
        }
        filter.hasStart = filter.startTime > 0;
    }
    if ((getParam("endDate", dateText, sizeof(dateText)) || getParam("to", dateText, sizeof(dateText)))) {
        if (!parseDate(dateText, filter.endTime)) {
            Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_date\"}");
            return;
        }
        filter.hasEnd = filter.endTime > 0;
        if (filter.hasEnd) {
            filter.endTime = UINT32_MAX - filter.endTime < 86399UL ? UINT32_MAX : filter.endTime + 86399UL;
        }
    }
    if (filter.hasStart && filter.hasEnd && filter.endTime < filter.startTime) {
        Esp32BaseWeb::sendJson(400, "{\"error\":\"invalid_date\"}");
        return;
    }
    if ((filter.hasStart || filter.hasEnd) && waterTaskActive()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\"}");
        return;
    }

